suda-morris/MSP430F5529Applications/Display/HAL_Dogs102x6.c
void Dogs102x6_imageDraw(const uint8_t IMAGE[], uint8_t row, uint8_t col)
{
    // height in rows (row = 8 pixels), width in columns
    uint8_t a, height, width;

    width = IMAGE[0];
    height = IMAGE[1];
    for (a = 0; a < height; a++)
    {
        Dogs102x6_setAddress(row + a, col);
        // Draw a row of the image
        Dogs102x6_writeData((uint8_t*)IMAGE + 2 + a * width, width);
    }
}

/***************************************************************************//**
 * @brief   Clears an area of size = height * width, starting at (row,col).
 *
 *          (0,0) is the upper left corner of screen.
 * @param   height  The number of rows in the image. Size = Rows * Columns.
 * @param   width   The number of columns in the image. Size = Rows * Columns.
 * @param   row row of the image's starting location
 * @param   col column of the image's starting location
 * @return None
 ******************************************************************************/

void Dogs102x6_clearImage(uint8_t height, uint8_t width, uint8_t row, uint8_t col)
{
    uint8_t a, b;
    uint8_t cmd[] = {0x00};

    for (a = 0; a < height; a++)
    {
        Dogs102x6_setAddress(row + a, col);
        for (b = 0; b < width; b++)
        {
            // clear a byte
            Dogs102x6_writeData(cmd, 1);
        }
    }
}


/***************************************************************************//**
 * @}
 ******************************************************************************/
//X表示行，0~7;Y表示列，0~101
unsigned char Dogs102x6_IntDraw(uint8_t x, uint8_t y, signed long value, uint8_t style)
{
	Dogs102x6_ClrBeforeCover(x,y);
	if(value < 0)
	{
		Dogs102x6_charDraw(x,y,'-',style);
		value = -value;
	}
	else
	{
		Dogs102x6_charDraw(x,y,'+',style);
	}
	unsigned char count=0;
	signed char i=0;
	char* str = NULL;
	signed long temp = value;						//此时value非负
	if(value == 0)
	{
		count = 1;
	}
	while(temp)
	{
		count++;
		temp /= 10;
	}
	str = (char*)calloc(count+1,1);
	str[count] = '\0';
	for(i=count-1;i>=0;i--)
	{
		str[i] = (value%10)+'0';
		value /= 10;
	}
	Dogs102x6_stringDraw(x,y+6,str,style);
	free(str);
	return count+1;									//‘1’表示符号位
}

void Dogs102x6_DoubleDraw(uint8_t x, uint8_t y, double value, uint8_t dot, uint8_t style)
{
	char dot1 = dot;
	signed long temp = (signed long)(value);
	unsigned char length = 0;
	char* str = (char*)calloc(dot+1,1);
	signed char i;
	length = Dogs102x6_IntDraw(x,y,temp,style);
	Dogs102x6_charDraw(x,y+6*length,'.', style);
	value = abs(value)-abs(temp);							//确保value是正数
	while(dot--)
	{
		value *= 10;
	}
	dot = dot1;
	temp = (signed long)(value);
	str[dot] = '\0';
	for(i=dot-1;i>=0;i--)
	{
		str[i] = temp%10 + '0';
		temp /= 10;
	}
	Dogs102x6_stringDraw(x,y+6*(length+1),str,style);
	free(str);
}

void Dogs102x6_ClrBeforeCover(uint8_t row,uint8_t col)
{
	uint8_t cmd[] = {0};
	uint8_t a = 0;

	// Check row boundary
	if (row > 7)
	{
	    row = 7;
	}

	Dogs102x6_setAddress(row, col);
	for (a = col; a < col+30; a++)
	{
	    Dogs102x6_writeData(cmd, 1);
	    dogs102x6Memory[2 + (row * 102) + a] = 0x00;
	}
}

/*
 * 十六进制显示程序
 * X表示行，0~7;Y表示列，0~101
 */
void Dogs102x6_ShowHEX(uint8_t x, uint8_t y, uint8_t *p, uint8_t length, uint8_t style)
{
	uint8_t i;
	char* num = (char *)calloc(2*length+1,sizeof(p[0]));
	for(i=0;i<length;i++)
	{
		num[i*2]=p[i]/16;
		num[i*2]>9?(num[i*2]+='7'):(num[i*2]+='0');
		num[i*2+1]=p[i]%16;
		num[i*2+1]>9?(num[i*2+1]+='7'):(num[i*2+1]+='0');
	}
	num[2*length]='\0';
	Dogs102x6_stringDraw(x,y,num,style);
	free(num);
}

//显示P1菜单页
void Dogs102x6_MenuP1_Construct()
{
	Dogs102x6_init();
	Dogs102x6_backlightInit();
	Dogs102x6_setContrast(10);
	Dogs102x6_setBacklight(5);
	Dogs102x6_clearScreen();
	Dogs102x6_stringDrawXY(1,1,"SoochowUniversity",DOGS102x6_DRAW_NORMAL);
	Dogs102x6_lineDraw(0,0,102,0,DOGS102x6_DRAW_NORMAL);
	Dogs102x6_lineDraw(102,0,102,64,DOGS102x6_DRAW_NORMAL);
	Dogs102x6_lineDraw(0,0,0,64,DOGS102x6_DRAW_NORMAL);
	Dogs102x6_lineDraw(0,64,102,64,DOGS102x6_DRAW_NORMAL);
	Dogs102x6_stringDraw(7,90,"P1",DOGS102x6_DRAW_NORMAL);
}

